Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་དྲུག་ཅུ་གཅིག་པའོ།། །།
en: This completes the sixty-first chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.” {

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Ki.

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་དངོས་པོ་མ་མཆིས་པ། དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་རྣམས་ལ། འདི་དག་ནི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་སོ། །འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་རང་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ།
en: VIII: 44} Thereupon, the venerable Subhūti asked the Blessed One, “Blessed Lord, since all phenomena are dreamlike nonentities, with the essential nature of nonentity and empty of intrinsic defining characteristics, how then can it be established that these are virtuous phenomena, these are nonvirtuous phenomena, these are mundane phenomena, these are supramundane phenomena, these are contaminated phenomena, these are uncontaminated phenomena, these are conditioned phenomena, these are unconditioned phenomena, these will be conducive to actualizing the fruit of entering the stream to nirvāṇa, these will be conducive to actualizing the fruit of being destined for only one more rebirth or the fruit of no longer being subject to rebirth and arhatship, these will be conducive to individual enlightenment, and these will be conducive to unsurpassed, complete enlightenment?

source: །འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ། །ཞེས་བགྱི་བར་ཇི་ལྟར་རྣམ་པར་དགོད་པར་འགྱུར། ཆོས་ཐམས་ཅད་སྒྲ་བརྙན་ལྟ་བུ། མིག་ཡོར་ལྟ་བུ། སྒྱུ་མ་ལྟ་བུ། སྨིག་རྒྱུ་ལྟ་བུ། སྤྲུལ་པ་ལྟ་བུ། དངོས་པོ་མ་མཆིས་པ། དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་རྣམས་ལ། འདི་དག་ནི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་སོ། །འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་རང་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ།
en: Since all phenomena that resemble an echo, phenomena that resemble an optical aberration, and that resemble a magical display, a mirage, and a phantom are nonentities with the essential nature of nonentity, and empty of intrinsic defining characteristics, how can it be established that these are virtuous phenomena, these are nonvirtuous phenomena, these are mundane phenomena, these are supramundane phenomena, these are contaminated phenomena, these are uncontaminated phenomena, these are conditioned phenomena, these are unconditioned phenomena, these will be conducive to actualizing the fruit of entering the stream to nirvāṇa, these will be conducive to actualizing the fruit of being destined for only one more rebirth or the fruit of no longer being subject to rebirth and arhatship, these will be conducive to individual enlightenment, and these will be conducive to unsurpassed, complete enlightenment?” “

source: །ཞེས་བགྱི་བར་ཇི་ལྟར་རྣམ་པར་དགོད་པར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱིས་པ་ཐོས་པ་དང་མི་ལྡན་པ་སོ་སོའི་སྐྱེ་བོ་ནི་རྨི་ལམ་ཡང་དམིགས་ལ། རྨི་ལམ་མཐོང་བ་ཡང་དམིགས་སོ།
en: In this regard, Subhūti,” replied the Blessed One, “common, simple people who have not studied [this discourse] apprehend dreams and they also apprehend viewers of dreams.

source: །སྒྲ་བརྙན་ཡང་དམིགས་ལ། སྒྲ་བརྙན་ཉན་པ་ཡང་དམིགས་སོ།
en: They apprehend echoes and they also apprehend hearers of echoes.

source: །མིག་ཡོར་ཡང་དམིགས་ལ། མིག་ཡོར་མཐོང་བ་ཡང་དམིགས་སོ།
en: They apprehend optical aberrations and they also apprehend viewers of optical aberrations.

source: །སྒྱུ་མ་ཡང་དམིགས་ལ། སྒྱུ་མ་མཐོང་བ་ཡང་དམིགས་སོ། །སྨིག་རྒྱུ་ཡང་དམིགས་ལ།
en: They apprehend magical displays and they also apprehend viewers of magical displays.

source: སྨིག་རྒྱུ་མཐོང་བ་ཡང་དམིགས་སོ། །སྤྲུལ་པ་ཡང་དམིགས་ལ།
en: They apprehend mirages and they also apprehend viewers of mirages.

source: སྤྲུལ་པ་མཐོང་བ་ཡང་དམིགས་སོ། །དེས་རྨི་ལམ་ཡང་དམིགས། རྨི་ལམ་མཐོང་བ་ཡང་དམིགས།
en: They apprehend phantoms and they also apprehend viewers of phantoms. {

source: སྤྲུལ་པའི་བར་ཡང་དམིགས།
en: Ki.

source: སྤྲུལ་པ་མཐོང་བ་ཡང་དམིགས་ནས། ལུས་དང་ངག་དང་། ཡིད་ཀྱིས་དགེ་བའི་འདུ་བྱ་བ་ཡང་མངོན་པར་འདུ་བྱེད་དོ།
en: VIII: 45} Then, on that basis, they actualize virtuous formative predispositions through body, speech, and mind.

source: །ལུས་དང་ངག་དང་། ཡིད་ཀྱིས་མི་དགེ་བའི་འདུས་བྱ་བ་ཡང་མངོན་པར་འདུ་བྱེད་དོ།
en: They also actualize nonvirtuous formative predispositions through body, speech, and mind.

source: །ལུས་དང་ངག་དང་ཡིད་ཀྱིས་བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་དང་། མི་གཡོ་བའི་འདུ་བྱ་བ་ཡང་མངོན་པར་འདུ་བྱེད་དོ། །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ།
en: They also actualize formative predispositions of the meritorious, nonmeritorious, and neutral sorts through body, speech, and mind. “

source: མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་གཉིས་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། ཁམས་གསུམ་འདི་ནི་སྟོང་པ་སྟེ།
en: On the other hand, bodhisattva great beings who practice the perfection of wisdom teach the Dharma to beings, while abiding in the twofold emptiness—that is to say the emptiness of the unlimited and the emptiness of that which has neither beginning nor end—[and they say], ‘These three realms are empty.

source: འདི་ལ་གཟུགས་སམ། ཚོར་བ་འམ། འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་འམ། སྐྱེ་མཆེད་རྣམས་སམ། ཁམས་རྣམས་མེད་དོ།
en: In them there are no physical forms, feelings, perceptions, formative predispositions, consciousness, sense fields, or sensory elements.

source: །འདི་ནི་རྨི་ལམ། འདི་ནི་སྒྲ་བརྙན། འདི་ནི་མིག་ཡོར། འདི་ནི་སྒྱུ་མ། འདི་ནི་སྨིག་རྒྱུ།
en: They are a dream, they are an echo, they are an optical aberration, they are a magical display, they are a mirage, and they are a phantom.

source: འདི་ནི་སྤྲུལ་པ་སྟེ། འདི་ལ་ཕུང་པོ་རྣམས་སམ། སྐྱེ་མཆེད་རྣམས་སམ། ཁམས་རྣམས་མེད་དོ།
en: In them there are no psycho-physical aggregates, sense fields, or sensory elements.

source: །འདི་ལ་རྨི་ལམ་མེད་དོ། །རྨི་ལམ་མཐོང་བ་མེད་དོ།
en: In them there is no dream or viewer of dreams.

source: །སྒྲ་བརྙན་མེད་དོ། །སྒྲ་བརྙན་ཉན་པ་མེད་དོ།
en: There is no echo or hearer of echoes.

source: །མིག་ཡོར་མེད་དོ། །མིག་ཡོར་མཐོང་བ་མེད་དོ།
en: There is no optical aberration or viewer of optical aberrations.

source: །སྒྱུ་མ་མེད་དོ། །སྒྱུ་མ་བྱེད་པ་མེད་དོ།
en: There is no magical display or creator of magical displays.

source: །སྨིག་རྒྱུ་མེད་དོ། །སྨིག་རྒྱུ་མཐོང་བ་མེད་དོ།
en: There is no mirage or viewer of mirages.

source: །སྤྲུལ་པ་མེད་དོ། །སྤྲུལ་པ་བྱེད་པ་མེད་དོ།
en: There is no phantom or viewer of phantoms.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ན། འོན་ཀྱང་ཁྱེད་ནི་ཕུང་པོ་མེད་པ་ལ་ཕུང་པོར་འདུ་ཤེས་པ།
en: All these phenomena are nonentities and of the essential nature of nonentity, but you perceive psycho-physical aggregates when there are no psycho-physical aggregates!

source: སྐྱེ་མཆེད་མེད་པ་ལ་སྐྱེ་མཆེད་དུ་འདུ་ཤེས་པ།
en: You perceive sense fields when there are no sense fields!

source: ཁམས་མེད་པ་ལ་ཁམས་སུ་འདུ་ཤེས་པ་དག་སྟེ།
en: You perceive sensory elements when there are no sensory elements!

source: ཆོས་འདི་དག་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཕྱིན་ཅི་ལོག་ལས་སྐྱེས་པ། ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་བཟུང་བ་ཡིན་ན། ཁྱེད་རྣམས་ཅིའི་ཕྱིར་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པ་ལ། དངོས་པོའི་འདུ་ཤེས་སུ་བྱེད་ཅེས་ཏེ།
en: Since all these phenomena arise erroneously from dependent origination, and have been grasped through the maturation of past actions, why else would you perceive the nonentity of all phenomena as entities?’ “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་སེར་སྣ་ཅན་དག་སེར་སྣ་ལས་རྣམ་པར་བཟློག་ནས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱོར་ཏེ།
en: When bodhisattva great beings practice the perfection of wisdom, with skill in means, they turn miserly beings away from miserliness, and commit them to the perfection of generosity.

source: སྦྱིན་པ་ཡོངས་སུ་བཏང་བ་དེ་ཡང་དེ་དག་ལ་ལོངས་སྤྱོད་ཆེན་པོའི་རྒྱུར་འགྱུར་རོ།
en: The dispensing of generosity on the part of those [beings] is conducive to great resources.

source: །དེས་དེ་དག་དེ་ལས་བསྐྱོད་ནས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱོར་ཏེ།
en: But turning them away from that [indulgence], [the bodhisattvas] then commit them to ethical discipline.

source: ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་པ་དེ་ཡང་དེ་དག་ལ་མཐོ་རིས་སུ་སྐྱེ་བའི་རྒྱུར་འགྱུར་རོ།
en: The adopting of ethical discipline on the part of those [beings] is conducive to rebirth in the exalted realms.

source: །དེས་དེ་དག་དེ་ལས་བསྐྱོད་ནས། ཏིང་ངེ་འཛིན་ལ་སྦྱོར་ཏེ།
en: But turning them away from that [indulgence], [the bodhisattvas] then commit them to meditative stability.

source: ཏིང་ངེ་འཛིན་དེ་ཡང་དེ་དག་ལ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བའི་རྒྱུར་འགྱུར་རོ།
en: The meditative stability on the part of those [beings] is conducive to rebirth in the worlds of Brahmā.

source: །དེས་དེ་དག་དེ་ལས་བསྐྱོད་ནས་བསམ་གཏན་དང་པོ་ལ་སྦྱོར་ཏེ། བསམ་གཏན་དང་པོ་ལས་བསམ་གཏན་གཉིས་པ།
en: But turning them away from [that indulgence, the bodhisattvas] commit them to the first meditative concentration, and from the first meditative concentration, they commit them to the second meditative concentration.

source: བསམ་གཏན་གཉིས་པ་ལས་བསམ་གཏན་གསུམ་པ་བསམ་གཏན་གསུམ་པ་ལས་བསམ་གཏན་བཞི་པ།
en: They turn them away from the second meditative concentration and commit them to the third meditative concentration. They turn them away from the third meditative concentration and commit them to the fourth meditative concentration.

source: བསམ་གཏན་བཞི་པ་ལས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ།
en: They turn them away from the fourth meditative concentration and commit them to the [formless] absorption of the sphere of infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ།
en: They turn them away from the [formless] absorption of the sphere of infinite space, and commit them to the [formless] absorption of the sphere of infinite consciousness.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ།
en: They turn them away from the [formless] absorption of the sphere of infinite consciousness, and commit them to the [formless] absorption of the sphere of nothing-at-all.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་སྦྱོར་རོ།
en: They turn them away from the [formless] absorption of the sphere of nothing-at-all, and commit them to the [formless] absorption of the sphere of neither perception nor nonperception. “

source: །དེས་སྦྱིན་པ་དང་། སྦྱིན་པའི་འབྲས་བུ་དམའ་བ་དེ་ལས་རྣམས་གྲངས་དུ་མས་བསྐྱོད་དེ།
en: Thereupon, through many ways they turn some beings away from generosity and the fruit of generosity, {Ki.

source: ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་དབུགས་འབྱིན་ཏོ།
en: VIII: 46} and inspire them, induce them, and establish them in the expanse of nirvāṇa, where there is no residue of the psycho-physical aggregates.

source: །གཞོག་གོ །རབ་ཏུ་འགོད་དོ། །དེས་ཚུལ་ཁྲིམས་དང་། ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་དེ་ལས་རྣམ་གྲངས་དུ་མས་བསྐྱོད་དེ་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་རབ་ཏུ་གཞོག་གོ །དེས་ཏིང་ངེ་འཛིན་དང་།
en: Through many ways they turn them away from ethical discipline and the fruit of ethical discipline, and induce them toward the expanse of nirvāṇa, where there is no residue of the psycho-physical aggregates.

source: ཏིང་ངེ་འཛིན་གྱི་འབྲས་བུ་དེ་ལས་རྣམ་གྲངས་དུ་མས་བསྐྱོད་དེ། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་རབ་ཏུ་གཞོག་གོ །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་།
en: Through many ways, they turn them away from meditative stability and the fruit of meditative stability, and induce them toward the expanse of nirvāṇa, where there is no residue of the psycho-physical aggregates.

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: Through many ways, they also turn some beings away from the meditative stabilities, the [formless] absorptions, the fruit of the meditative stabilities, and the fruit of the [formless] absorptions, and, reversing their resolve, induce them to enter and become established in the expanse of nirvāṇa, where there is no residue of the psycho-physical aggregates. “

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་དག་པར་སྟོན་ཏོ། །ཡང་དག་པར་སྐུལ་ལོ། །ཡང་དག་པར་གཟེང་བསྟོད་དོ། །ཡང་དག་པར་དགའ་བར་བྱེད་དོ། །འདུལ་ལོ། །གཞོག་གོ །
en: They then reveal, encourage, praise, and rejoice in [the causal and fruitional attributes], training and inducing [beings] and establishing them in the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas. “

source: རབ་ཏུ་འགོད་དོ། །དེ་ཟག་པ་མེད་པའི་ཆོས་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ། དེ་དག་གིས་གང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དོན་དུ་གཉེར་བ་དེ་དག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་དོ།
en: Through these [attributes], which are without contaminants, immaterial, unrevealed, and unimpeded, they establish in the fruit of entering the stream to nirvāṇa those who strive toward the fruit of entering the stream to nirvāṇa.

source: །གང་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དོན་དུ་གཉེར་བ་དེ་དག་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish in the fruit of being destined for only one more rebirth those who strive toward the fruit of being destined for only one more rebirth.

source: །གང་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དོན་དུ་གཉེར་བ་དེ་དག་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish in the fruit of no longer being subject to rebirth those who strive toward the fruit of no longer being subject to rebirth.

source: །གང་དགྲ་བཅོམ་པ་ཉིད་དོན་དུ་གཉེར་བ་དེ་དག་དགྲ་བཅོམ་པ་ཉིད་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish in arhatship those who strive toward arhatship.

source: །གང་རང་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་དེ་དག་རང་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish in individual enlightenment those who strive toward individual enlightenment.

source: །གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་དེ་དག་ལ་བྱང་ཆུབ་ཀྱི་ལམ་རྗོད་ཅིང་སྟོན་ཏོ། །ཡང་དག་པར་སྐུལ་ལོ། །ཡང་དག་པར་གཟེང་བསྟོད་དོ། །ཡང་དག་པར་དགའ་བར་བྱེད་དོ། །འདུལ་ལོ། །གཞོག་གོ །རབ་ཏུ་འགོད་དོ།
en: They describe and reveal the path of [unsurpassed] enlightenment to those who strive toward unsurpassed, complete enlightenment, encouraging, praising, and rejoicing in them, while training, inducing, and establishing them in it.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྨྱིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུ་དང་། དངོས་པོ་མེད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་རྣམ་པར་དགོད་པར་བྱེད་དོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they establish that all phenomena are dreamlike, like an echo, like an optical aberration, like a magical display, like a mirage, like a phantom, nonentities with an essential nature of nonentity, and empty of intrinsic defining characteristics.”

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་དང་། ཆོས་ཐམས་ཅད་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མ་མཆིས་པ་སྟོང་པ་ཉིད་ལ་འདི་དག་ནི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་སོ། །འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་རང་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ།
en: The venerable Subhūti then said to the Blessed One, “Blessed Lord, how wonderful and marvelous it is that when bodhisattva great beings practice this profound perfection of wisdom, they should establish that all phenomena are of the essential nature of nonentity, that all phenomena are endowed with the emptiness of the unlimited and the emptiness of that which has neither beginning nor end, and yet [distinguish that] these are virtuous phenomena, these are nonvirtuous phenomena, these are mundane phenomena, these are supramundane phenomena, these are inadmissible phenomena, these are admissible phenomena, these are contaminated phenomena, these are uncontaminated phenomena, these are conditioned phenomena, these are unconditioned phenomena, these will be conducive to actualizing the fruit of entering the stream to nirvāṇa, these will be conducive to actualizing the fruit of being destined for only one more rebirth or the fruit of no longer being subject to rebirth and the fruit of arhatship, these will be conducive to individual enlightenment, and these will be conducive to unsurpassed, complete enlightenment!”

source: །ཞེས་བགྱི་བར་རྣམ་པར་དགོད་པར་བགྱིད་པ་ནི། ངོ་མཚར་དེ་རྨད་དུ་བྱུང་བའི་ཆོས་སོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།
en: The Blessed One replied to the venerable Subhūti, “Subhūti, it is so!

source: །དེ་དེ་བཞིན་ཏེ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉིད་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། ཆོས་ཐམས་ཅད་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ལ་འདི་དག་ནི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་སོ། །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའི་ཆོས་སོ། །འདི་དག་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཆོས་སོ། །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་སོ།
en: It is so.

source: །འདི་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་སོ། །འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་རྒྱུར་འགྱུར་བའོ།
en: It is wonderful and marvelous that when bodhisattva great beings practice this profound perfection of wisdom accordingly, they may establish that all phenomena are of the essential nature of nonentity, that all phenomena are endowed with the emptiness of the unlimited and the emptiness of that which has neither beginning nor end, and yet [distinguish that] these are virtuous phenomena, these are nonvirtuous phenomena, these are mundane phenomena, these are supramundane phenomena, these are inadmissible phenomena, these are admissible phenomena, these are contaminated phenomena, these are uncontaminated phenomena, these are conditioned phenomena, these are unconditioned phenomena, these will be conducive to actualizing the fruit of entering the stream to nirvāṇa, these will be conducive to actualizing the fruit of being destined for only one more rebirth or the fruit of no longer being subject to rebirth and the fruit of arhatship, these will be conducive to individual enlightenment, and that these will be conducive to unsurpassed, complete enlightenment. “

source: །འདི་དག་ནི་རང་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ། །འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བའོ། །ཞེས་བྱ་བར་རྣམ་པར་དགོད་པར་བྱེད་པ་དེ་ནི་ངོ་མཚར་ཏེ་རྨད་དུ་བྱུང་བའི་ཆོས་སོ། །རབ་འབྱོར་གལ་ཏེ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གི་ངོ་མཚར་རྨད་ཀྱི་ཆོས་དེ་ཤེས་ཀྱང་།
en: If, Subhūti, you understand these wondrous and marvelous attributes of bodhisattva great beings, {Ki.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་སླར་ཕན་གདགས་པར་བྱ་བ་སླ་བ་མ་ཡིན་ཏེ།
en: VIII: 47} [you will appreciate that] it is not easy for all the śrāvakas and pratyekabuddhas to repay the favors of those bodhisattva great beings.

source: ཁྱེད་ཅག་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དེ་ཟིལ་གྱིས་གནོནཔར་མི་ནུས་སོ།
en: Indeed, there is no one among you who can surpass these attributes of bodhisattva great beings.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་མ་མཆིས་པའི་ངོ་མཚར་རྨད་ཀྱི་ཆོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་མཆིས་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, what are the wonderful and marvelous attributes of bodhisattva great beings who practice the perfection of wisdom, which are unknown to all śrāvakas and pratyekabuddhas?” “

source: རབ་འབྱོར་དེའི་ཕྱིར་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་གྱིས་ཤིག་དང་བཤད་པར་བྱའོ།
en: For that, Subhūti, you should listen carefully and pay attention!” replied the Blessed One. “I will explain.

source: །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་།
en: In this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they are established in the six perfections, which arise through the maturation [of past actions].

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གནས་ཤིང་།
en: They are established in all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.
